request.xml

<?xml version="1.0" encoding="UTF-8"?> <SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0" xmlns:ns2="http://www.ups.com/XMLSchema/XOLTWS/FreightRate/v1.0" xmlns:ns3="http://www.ups.com/XMLSchema/XOLTWS/UPSS/v1.0"><SOAP-ENV:Header><ns3:UPSSecurity><ns3:UsernameToken><ns3:Username>MyUsername</ns3:Username><ns3:Password>MyPass</ns3:Password></ns3:UsernameToken><ns3:ServiceAccessToken><ns3:AccessLicenseNumber>ABCDEFGHIKJLM</ns3:AccessLicenseNumber></ns3:ServiceAccessToken></ns3:UPSSecurity></SOAP-ENV:Header><SOAP-ENV:Body><ns2:FreightRateRequest><ns1:Request><ns1:RequestOption>RateChecking Option</ns1:RequestOption></ns1:Request><ns2:ShipFrom><ns2:Name>Good Incorporation</ns2:Name><ns2:Address><ns2:AddressLine>2010 WARSAW ROAD</ns2:AddressLine><ns2:City>Roswell</ns2:City><ns2:StateProvinceCode>GA</ns2:StateProvinceCode><ns2:PostalCode>30076</ns2:PostalCode><ns2:CountryCode>US</ns2:CountryCode></ns2:Address></ns2:ShipFrom><ns2:ShipTo><ns2:Name>Sony Company Incorporation</ns2:Name><ns2:Address><ns2:AddressLine>2311 YORK ROAD</ns2:AddressLine><ns2:City>TIMONIUM</ns2:City><ns2:StateProvinceCode>MD</ns2:StateProvinceCode><ns2:PostalCode>21093</ns2:PostalCode><ns2:CountryCode>US</ns2:CountryCode></ns2:Address></ns2:ShipTo><ns2:PaymentInformation><ns2:Payer><ns2:Name>Payer inc</ns2:Name><ns2:Address><ns2:AddressLine>435 SOUTH STREET</ns2:AddressLine><ns2:City>RIS TOWNSHIP</ns2:City><ns2:StateProvinceCode>NJ</ns2:StateProvinceCode><ns2:PostalCode>07960</ns2:PostalCode><ns2:CountryCode>US</ns2:CountryCode></ns2:Address></ns2:Payer><ns2:ShipmentBillingOption><ns2:Code>10</ns2:Code><ns2:Description>PREPAID</ns2:Description></ns2:ShipmentBillingOption></ns2:PaymentInformation><ns2:Service><ns2:Code>308</ns2:Code><ns2:Description>UPS Freight LTL</ns2:Description></ns2:Service><ns2:HandlingUnitOne><ns2:Quantity>20</ns2:Quantity><ns2:Type><ns2:Code>PLT</ns2:Code><ns2:Description>PALLET</ns2:Description></ns2:Type></ns2:HandlingUnitOne><ns2:Commodity><ns2:CommodityID></ns2:CommodityID><ns2:Description>No Description</ns2:Description><ns2:Weight><ns2:Value>750</ns2:Value><ns2:UnitOfMeasurement><ns2:Code>LBS</ns2:Code><ns2:Description>Pounds</ns2:Description></ns2:UnitOfMeasurement></ns2:Weight><ns2:Dimensions><ns2:UnitOfMeasurement><ns2:Code>IN</ns2:Code><ns2:Description>Inches</ns2:Description></ns2:UnitOfMeasurement><ns2:Length>23</ns2:Length><ns2:Width>17</ns2:Width><ns2:Height>45</ns2:Height></ns2:Dimensions><ns2:NumberOfPieces>45</ns2:NumberOfPieces><ns2:PackagingType><ns2:Code>BAG</ns2:Code><ns2:Description>BAG</ns2:Description></ns2:PackagingType><ns2:DangerousGoodsIndicator></ns2:DangerousGoodsIndicator><ns2:CommodityValue><ns2:CurrencyCode>USD</ns2:CurrencyCode><ns2:MonetaryValue>5670</ns2:MonetaryValue></ns2:CommodityValue><ns2:FreightClass>60</ns2:FreightClass><ns2:NMFCCommodityCode></ns2:NMFCCommodityCode></ns2:Commodity><ns2:ShipmentServiceOptions><ns2:PickupOptions><ns2:HolidayPickupIndicator></ns2:HolidayPickupIndicator><ns2:InsidePickupIndicator></ns2:InsidePickupIndicator><ns2:ResidentialPickupIndicator></ns2:ResidentialPickupIndicator><ns2:WeekendPickupIndicator></ns2:WeekendPickupIndicator><ns2:LiftGateRequiredIndicator></ns2:LiftGateRequiredIndicator></ns2:PickupOptions><ns2:OverSeasLeg><ns2:Dimensions><ns2:Volume>20</ns2:Volume><ns2:UnitOfMeasurement><ns2:Code>CF</ns2:Code><ns2:Description>String</ns2:Description></ns2:UnitOfMeasurement></ns2:Dimensions><ns2:Value><ns2:Cube><ns2:CurrencyCode>USD</ns2:CurrencyCode><ns2:MonetaryValue>5670</ns2:MonetaryValue></ns2:Cube></ns2:Value></ns2:OverSeasLeg></ns2:ShipmentServiceOptions></ns2:FreightRateRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>