XOLTResult.xml

Request: 
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0" xmlns:ns2="http://www.ups.com/XMLSchema/XOLTWS/FreightRate/v1.0" xmlns:ns3="http://www.ups.com/XMLSchema/XOLTWS/UPSS/v1.0"><SOAP-ENV:Header><ns3:UPSSecurity><ns3:UsernameToken><ns3:Username>command</ns3:Username><ns3:Password>#Pack3840</ns3:Password></ns3:UsernameToken><ns3:ServiceAccessToken><ns3:AccessLicenseNumber>9D193CF3301349FF</ns3:AccessLicenseNumber></ns3:ServiceAccessToken></ns3:UPSSecurity></SOAP-ENV:Header><SOAP-ENV:Body><ns2:FreightRateRequest><ns1:Request><ns1:RequestOption>RateChecking Option</ns1:RequestOption></ns1:Request><ns2:ShipFrom><ns2:Name>Good Incorporation</ns2:Name><ns2:Address><ns2:AddressLine>2010 WARSAW ROAD</ns2:AddressLine><ns2:City>Roswell</ns2:City><ns2:StateProvinceCode>GA</ns2:StateProvinceCode><ns2:PostalCode>30076</ns2:PostalCode><ns2:CountryCode>US</ns2:CountryCode></ns2:Address></ns2:ShipFrom><ns2:ShipTo><ns2:Name>Sony Company Incorporation</ns2:Name><ns2:Address><ns2:AddressLine>2311 YORK ROAD</ns2:AddressLine><ns2:City>TIMONIUM</ns2:City><ns2:StateProvinceCode>MD</ns2:StateProvinceCode><ns2:PostalCode>21093</ns2:PostalCode><ns2:CountryCode>US</ns2:CountryCode></ns2:Address></ns2:ShipTo><ns2:PaymentInformation><ns2:Payer><ns2:Name>Payer inc</ns2:Name><ns2:Address><ns2:AddressLine>435 SOUTH STREET</ns2:AddressLine><ns2:City>RIS TOWNSHIP</ns2:City><ns2:StateProvinceCode>NJ</ns2:StateProvinceCode><ns2:PostalCode>07960</ns2:PostalCode><ns2:CountryCode>US</ns2:CountryCode></ns2:Address></ns2:Payer><ns2:ShipmentBillingOption><ns2:Code>10</ns2:Code><ns2:Description>PREPAID</ns2:Description></ns2:ShipmentBillingOption></ns2:PaymentInformation><ns2:Service><ns2:Code>308</ns2:Code><ns2:Description>UPS Freight LTL</ns2:Description></ns2:Service><ns2:HandlingUnitOne><ns2:Quantity>20</ns2:Quantity><ns2:Type><ns2:Code>PLT</ns2:Code><ns2:Description>PALLET</ns2:Description></ns2:Type></ns2:HandlingUnitOne><ns2:Commodity><ns2:CommodityID></ns2:CommodityID><ns2:Description>No Description</ns2:Description><ns2:Weight><ns2:Value>5000</ns2:Value><ns2:UnitOfMeasurement><ns2:Code>LBS</ns2:Code><ns2:Description>Pounds</ns2:Description></ns2:UnitOfMeasurement></ns2:Weight><ns2:Dimensions><ns2:UnitOfMeasurement><ns2:Code>IN</ns2:Code><ns2:Description>Inches</ns2:Description></ns2:UnitOfMeasurement><ns2:Length>23</ns2:Length><ns2:Width>17</ns2:Width><ns2:Height>45</ns2:Height></ns2:Dimensions><ns2:NumberOfPieces>45</ns2:NumberOfPieces><ns2:PackagingType><ns2:Code>BAG</ns2:Code><ns2:Description>BAG</ns2:Description></ns2:PackagingType><ns2:DangerousGoodsIndicator></ns2:DangerousGoodsIndicator><ns2:CommodityValue><ns2:CurrencyCode>USD</ns2:CurrencyCode><ns2:MonetaryValue>5670</ns2:MonetaryValue></ns2:CommodityValue><ns2:FreightClass>60</ns2:FreightClass><ns2:NMFCCommodityCode></ns2:NMFCCommodityCode></ns2:Commodity></ns2:FreightRateRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>

Response: 
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/><soapenv:Body><freightRate:FreightRateResponse xmlns:freightRate="http://www.ups.com/XMLSchema/XOLTWS/FreightRate/v1.0"><common:Response xmlns:common="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0"><common:ResponseStatus><common:Code>1</common:Code><common:Description>Success</common:Description></common:ResponseStatus><common:Alert><common:Code>9369055</common:Code><common:Description>User is not eligible for contract rates.</common:Description></common:Alert></common:Response><freightRate:Rate><freightRate:Type><freightRate:Code>2</freightRate:Code><freightRate:Description>2</freightRate:Description></freightRate:Type><freightRate:Factor><freightRate:Value>465.77</freightRate:Value><freightRate:UnitOfMeasurement><freightRate:Code>USD</freightRate:Code></freightRate:UnitOfMeasurement></freightRate:Factor></freightRate:Rate><freightRate:Rate><freightRate:Type><freightRate:Code>LND_GROSS</freightRate:Code><freightRate:Description>LND_GROSS</freightRate:Description></freightRate:Type><freightRate:Factor><freightRate:Value>2364.30</freightRate:Value><freightRate:UnitOfMeasurement><freightRate:Code>USD</freightRate:Code></freightRate:UnitOfMeasurement></freightRate:Factor></freightRate:Rate><freightRate:Rate><freightRate:Type><freightRate:Code>AFTR_DSCNT</freightRate:Code><freightRate:Description>AFTR_DSCNT</freightRate:Description></freightRate:Type><freightRate:Factor><freightRate:Value>2364.30</freightRate:Value><freightRate:UnitOfMeasurement><freightRate:Code>USD</freightRate:Code></freightRate:UnitOfMeasurement></freightRate:Factor></freightRate:Rate><freightRate:Commodity><freightRate:Description>No Description</freightRate:Description><freightRate:Weight><freightRate:Value>5000</freightRate:Value><freightRate:UnitOfMeasurement><freightRate:Code>LBS</freightRate:Code></freightRate:UnitOfMeasurement></freightRate:Weight><freightRate:AdjustedWeight><freightRate:Value>5000</freightRate:Value><freightRate:UnitOfMeasurement><freightRate:Code>LBS</freightRate:Code></freightRate:UnitOfMeasurement></freightRate:AdjustedWeight></freightRate:Commodity><freightRate:TotalShipmentCharge><freightRate:CurrencyCode>USD</freightRate:CurrencyCode><freightRate:MonetaryValue>2830.07</freightRate:MonetaryValue></freightRate:TotalShipmentCharge><freightRate:BillableShipmentWeight><freightRate:Value>5000</freightRate:Value><freightRate:UnitOfMeasurement><freightRate:Code>LBS</freightRate:Code></freightRate:UnitOfMeasurement></freightRate:BillableShipmentWeight><freightRate:DimensionalWeight><freightRate:Value>0</freightRate:Value><freightRate:UnitOfMeasurement><freightRate:Code>LBS</freightRate:Code></freightRate:UnitOfMeasurement></freightRate:DimensionalWeight><freightRate:Service><freightRate:Code>308</freightRate:Code></freightRate:Service><freightRate:MinimumChargeAppliedIndicator/><freightRate:RatingSchedule><freightRate:Code>02</freightRate:Code><freightRate:Description>Published Rates</freightRate:Description></freightRate:RatingSchedule></freightRate:FreightRateResponse></soapenv:Body></soapenv:Envelope>
